In [19]:
import pandas as pd

In [20]:
data = {
    "Name": ["Ali", "Sara", "John", "Riya", "Aman", "Sara"],
    "Age": [22, 25, 23, 30, 29, 25],
    "City": ["Delhi", "Mumbai", "Delhi", "Pune", "Mumbai", "Mumbai"],
    "Salary": [50000, 60000, 52000, 80000, 75000, 60000],
    "Experience": [1, 3, 2, 7, 6, 3]
}

In [21]:
df=pd.DataFrame(data)

In [22]:
df

   Name  Age    City  Salary  Experience
0   Ali   22   Delhi   50000           1
1  Sara   25  Mumbai   60000           3
2  John   23   Delhi   52000           2
3  Riya   30    Pune   80000           7
4  Aman   29  Mumbai   75000           6
5  Sara   25  Mumbai   60000           3

# 1. head() and tail()

## for 1st 5 rows

In [23]:
df.head()

   Name  Age    City  Salary  Experience
0   Ali   22   Delhi   50000           1
1  Sara   25  Mumbai   60000           3
2  John   23   Delhi   52000           2
3  Riya   30    Pune   80000           7
4  Aman   29  Mumbai   75000           6

## for 1st 3 rows

In [24]:
df.head(3)

   Name  Age    City  Salary  Experience
0   Ali   22   Delhi   50000           1
1  Sara   25  Mumbai   60000           3
2  John   23   Delhi   52000           2

## for last 5 rows

In [25]:
df.tail()

   Name  Age    City  Salary  Experience
1  Sara   25  Mumbai   60000           3
2  John   23   Delhi   52000           2
3  Riya   30    Pune   80000           7
4  Aman   29  Mumbai   75000           6
5  Sara   25  Mumbai   60000           3

## for last 3 rows

In [26]:
df.tail(3)

   Name  Age    City  Salary  Experience
3  Riya   30    Pune   80000           7
4  Aman   29  Mumbai   75000           6
5  Sara   25  Mumbai   60000           3

# 2. info()

## gives:
## number of rows
## column names
## non-null counts
## data types
## memory usage

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         6 non-null      int64
 2   City        6 non-null      object
 3   Salary      6 non-null      int64
 4   Experience  6 non-null      int64
dtypes: int64(3), object(2)
memory usage: 372.0+ bytes

# 3. describe()

## Provides statistical summary for numerical columns:

## count
## mean
## std (standard deviation)
## min
## 25%, 50%, 75% percentiles
## max

In [28]:
df.describe()

             Age        Salary  Experience
count   6.000000      6.000000    6.000000
mean   25.666667  62833.333333    3.666667
std     3.204164  12172.373091    2.338090
min    22.000000  50000.000000    1.000000
25%    23.500000  54000.000000    2.250000
50%    25.000000  60000.000000    3.000000
75%    28.000000  71250.000000    5.250000
max    30.000000  80000.000000    7.000000

# 4. Value Counts

## Counts frequency of each unique value in a column.

In [30]:
df["City"].value_counts()

City
Mumbai    3
Delhi     2
Pune      1
Name: count, dtype: int64

## doubt

In [31]:
df["City"].value_counts(normalize=True) * 100

City
Mumbai    50.000000
Delhi     33.333333
Pune      16.666667
Name: proportion, dtype: float64

# 5. Unique Values